{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "eb177973",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "/Users/aiglesias/GitHub/solarchem-ontology\n"
     ]
    }
   ],
   "source": [
    "import rdflib\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import pandas as pd\n",
    "import os.path\n",
    "import requests\n",
    "import time\n",
    "import json\n",
    "from jsonpath_ng import jsonpath, parse\n",
    "import urllib.parse\n",
    "import csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "86b55210",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "/Users/aiglesias/GitHub/solarchem-ontology/knowledge-graph\n"
     ]
    }
   ],
   "source": [
    "try:\n",
    "    os.chdir(os.path.join(os.getcwd(), 'knowledge-graph')) \n",
    "    print(os.getcwd())\n",
    "except:\n",
    "    pass"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "683a0d51",
   "metadata": {},
   "source": [
    "# Construction, enrichment and evaluation of the Solarchem Knowledge Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "23e14cd0",
   "metadata": {},
   "source": [
    "## Mapping generation\n",
    "Running Mapeathor to create the mapping file in YARRRML"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "92cbf7d5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generating mapping file\n",
      "Your mapping file is in mappings/solarchem-mapping.yml\n"
     ]
    }
   ],
   "source": [
    "!python -m mapeathor -i mappings/solarchem-mapping.xlsx -l yarrrml -o mappings/solarchem-mapping"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6c16f8c5",
   "metadata": {},
   "source": [
    "## KG construction\n",
    "Running Morph-KGC to construct the KG with the mapping generated in the previous step and the data in `./data`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "d7429326",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/mapping/mapping_parser.py:390: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  fnml_df = fnml_df.applymap(str)\n",
      "INFO | 2024-05-13 18:03:23,548 | 122 mapping rules retrieved.\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/mapping/mapping_parser.py:485: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`\n",
      "  self.rml_df = self.rml_df.replace(r'^\\s*$', np.nan, regex=True)\n",
      "INFO | 2024-05-13 18:03:23,625 | Mapping partition with 32 groups generated.\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/mapping/mapping_partitioner.py:182: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  f\"{self.rml_df['mapping_partition'].value_counts()[0]}.\")\n",
      "INFO | 2024-05-13 18:03:23,630 | Maximum number of rules within mapping group: 26.\n",
      "INFO | 2024-05-13 18:03:23,630 | Mappings processed in 2.690 seconds.\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/utils.py:257: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`\n",
      "  data = data.replace(config.get_na_values(), np.NaN)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/morph_kgc/materializer.py:36: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  data = data.applymap(str)\n",
      "INFO | 2024-05-13 18:03:35,020 | Number of triples generated in total: 475796.\n",
      "INFO | 2024-05-13 18:03:35,021 | Materialization finished in 11.385 seconds.\n"
     ]
    }
   ],
   "source": [
    "!python -m morph_kgc config.ini"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6d1363b1",
   "metadata": {},
   "source": [
    "## KG validation\n",
    "Quick validation to check that the KG is being generated with all the needed properties of the ontology."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "6665905a",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Failed to convert Literal lexical form to value. Datatype=http://www.w3.org/2001/XMLSchema#float, Converter=<class 'float'>\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/rdflib/term.py\", line 2119, in _castLexicalToPython\n",
      "    return conv_func(lexical)  # type: ignore[arg-type]\n",
      "ValueError: could not convert string to float: '4 ,6 '\n",
      "Failed to convert Literal lexical form to value. Datatype=http://www.w3.org/2001/XMLSchema#float, Converter=<class 'float'>\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/rdflib/term.py\", line 2119, in _castLexicalToPython\n",
      "    return conv_func(lexical)  # type: ignore[arg-type]\n",
      "ValueError: could not convert string to float: '0.5 + 1.0'\n",
      "Failed to convert Literal lexical form to value. Datatype=http://www.w3.org/2001/XMLSchema#float, Converter=<class 'float'>\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/rdflib/term.py\", line 2119, in _castLexicalToPython\n",
      "    return conv_func(lexical)  # type: ignore[arg-type]\n",
      "ValueError: could not convert string to float: '0.65:1'\n",
      "Failed to convert Literal lexical form to value. Datatype=http://www.w3.org/2001/XMLSchema#float, Converter=<class 'float'>\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/rdflib/term.py\", line 2119, in _castLexicalToPython\n",
      "    return conv_func(lexical)  # type: ignore[arg-type]\n",
      "ValueError: could not convert string to float: '0.26:1'\n",
      "Failed to convert Literal lexical form to value. Datatype=http://www.w3.org/2001/XMLSchema#float, Converter=<class 'float'>\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/aiglesias/miniconda3/envs/kgc/lib/python3.9/site-packages/rdflib/term.py\", line 2119, in _castLexicalToPython\n",
      "    return conv_func(lexical)  # type: ignore[arg-type]\n",
      "ValueError: could not convert string to float: '0.92:1'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "475783\n"
     ]
    }
   ],
   "source": [
    "g = rdflib.Graph()\n",
    "g.parse(\"result/solarchem.nt\")\n",
    "print(len(g))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "279f4e69",
   "metadata": {},
   "source": [
    "### Articles"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "650e7b6e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of articles: 1093\n"
     ]
    }
   ],
   "source": [
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX soa: <https://semopenalex.org/ontology/>\n",
    "    PREFIX solar: <http://w3id.org/solar/o/core#>\n",
    "\n",
    "    SELECT (COUNT (DISTINCT ?article) AS ?count)\n",
    "    WHERE {\n",
    "        ?article solar:hasExperimentExecution ?exp .\n",
    "    }\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"Number of articles: {row['count'].value}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ee419057",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of articles with all properties: 415\n"
     ]
    }
   ],
   "source": [
    "# old model (no soa)\n",
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "    SELECT (COUNT (DISTINCT ?article) AS ?count)\n",
    "    WHERE {\n",
    "        ?article a bibo:Article ;\n",
    "            bibo:doi ?doi ;\n",
    "            bibo:abstract ?abs ;\n",
    "            bibo:volume ?volume ;\n",
    "            dc:title ?title ;\n",
    "            bibo:issue ?issue ;\n",
    "            dc:date ?date ;\n",
    "            bibo:pageStart ?page .\n",
    "    }\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"Number of articles with all properties: {row['count'].value}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "22a1b7eb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of articles with experiments associated: 1096\n"
     ]
    }
   ],
   "source": [
    "# old model (no soa)\n",
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <http://w3id.org/solar/o/core#>\n",
    "\n",
    "    SELECT (COUNT (DISTINCT ?article) AS ?count)\n",
    "    WHERE {\n",
    "        ?article a bibo:Article ;\n",
    "            solar:hasExperimentExecution ?expexec .\n",
    "    }\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"Number of articles with experiments associated: {row['count'].value}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "227c2deb",
   "metadata": {},
   "source": [
    "### Experiment Executions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b820aca3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of experiments: 18315\n"
     ]
    }
   ],
   "source": [
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <http://w3id.org/solar/o/core#>\n",
    "\n",
    "    SELECT (COUNT (DISTINCT ?input) AS ?count)\n",
    "    WHERE {\n",
    "        ?expexec a solar:ExperimentExecution ;\n",
    "            solar:reportedIn ?article ;\n",
    "            prov:used ?input ;\n",
    "            solar:hasCondition ?condition ;\n",
    "            solar:hasLightSource ?lightsource .\n",
    "    }\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"Number of experiments: {row['count'].value}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b1a7876f",
   "metadata": {},
   "source": [
    "### Conditions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b8c088a9",
   "metadata": {},
   "outputs": [],
   "source": [
    "## Time, pressure, pH, temperature\n",
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <http://w3id.org/solar/o/core#>\n",
    "    PREFIX solarpc: <http://w3id.org/solar/o/pc#>\n",
    "    PREFIX qudt: <http://qudt.org/2.1/schema/qudt>\n",
    "\n",
    "    SELECT ?condition ?value ?unit\n",
    "    WHERE {\n",
    "        ?condition a solar:TimeCondition ; # solar:PressureCondition solar:pHCondition solar:TemperatureCondition\n",
    "            qudt:numericValue ?value ;\n",
    "            qudt:unit ?unit .\n",
    "    } LIMIT 10\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"{row.condition} {row.value} {row.unit} \")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "185a1a03",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3258\n"
     ]
    }
   ],
   "source": [
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <http://w3id.org/solar/o/core#>\n",
    "    PREFIX solarpc: <http://w3id.org/solar/o/pc#>\n",
    "    PREFIX qudt: <http://qudt.org/2.1/schema/qudt>\n",
    "\n",
    "    SELECT  (COUNT (DISTINCT ?expexec) AS ?count)\n",
    "    WHERE {\n",
    "        ?expexec solar:hasCondition solar:SlurryReactor ; \n",
    "            #solar:hasCondition [ \n",
    "            #    a solar:ReactorVolumeCondition ;\n",
    "            #    qudt:numericValue ?volume ] ;\n",
    "            #solar:hasCondition [ \n",
    "            #    a solar:ResidenceTimeCondition ;\n",
    "            #    qudt:numericValue ?restime ] ;\n",
    "    } LIMIT 10\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"{row['count'].value}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1b2a023d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2053\n"
     ]
    }
   ],
   "source": [
    "## Reactor medium and operation mode\n",
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <http://w3id.org/solar/o/core#>\n",
    "    PREFIX solarpc: <http://w3id.org/solar/o/pc#>\n",
    "    PREFIX qudt: <http://qudt.org/2.1/schema/qudt>\n",
    "\n",
    "    SELECT (COUNT (DISTINCT ?expexec) AS ?count)\n",
    "    WHERE {\n",
    "        ?expexec solar:hasCondition solar:GasMedium ; # solar:GasMedium\n",
    "            solar:hasCondition solar:BatchMode . # solar:ContinuousMode\n",
    "    } \n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(row['count'].value)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "0771b985",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of lightsources with all properties: 165\n"
     ]
    }
   ],
   "source": [
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <http://w3id.org/solar/o/core#>\n",
    "    PREFIX solarpc: <http://w3id.org/solar/o/pc#>\n",
    "    PREFIX qudt: <http://qudt.org/2.1/schema/qudt/>\n",
    "    PREFIX obi: <http://purl.obolibrary.org/obo/OBI_>\n",
    "\n",
    "    SELECT DISTINCT (COUNT (DISTINCT ?lightSource) AS ?count)\n",
    "    WHERE {\n",
    "        ?lightSource a obi:0400065 ;\n",
    "            solar:hasLamp ?lamp ;\n",
    "            solar:hasWavelength ?wl ;\n",
    "            solar:hasIrradiance [qudt:numericValue ?irradiance] ;\n",
    "            solar:hasPower [qudt:numericValue ?power] ;\n",
    "            solar:hasIlluminatedArea [qudt:numericValue ?illum_area] .\n",
    "            \n",
    "    } \n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"Number of lightsources with all properties: {row['count'].value}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e66dce90",
   "metadata": {},
   "source": [
    "### Inputs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "e2ad69e8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of catalyts with all properties: 6156\n"
     ]
    }
   ],
   "source": [
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <http://w3id.org/solar/o/core#>\n",
    "    PREFIX solarpc: <http://w3id.org/solar/o/pc#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX qudt: <http://qudt.org/2.1/schema/qudt/>\n",
    "\n",
    "    SELECT (COUNT (DISTINCT ?input) AS ?count)\n",
    "    WHERE {\n",
    "        ?input a solar:Input ;\n",
    "            rdfs:label ?label ;\n",
    "            solar:hasRole solar:Catalyst ;\n",
    "            qudt:numericValue ?value ;\n",
    "            qudt:unit ?unit ;\n",
    "            solar:hasBandGap ?bgap ;\n",
    "            solar:hasSurfaceArea ?surfacearea .\n",
    "    }\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"Number of catalyts with all properties: {row['count'].value}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "c60afbea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of co-catalyts with all properties: 3176\n"
     ]
    }
   ],
   "source": [
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <http://w3id.org/solar/o/core#>\n",
    "    PREFIX solarpc: <http://w3id.org/solar/o/pc#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX qudt: <http://qudt.org/2.1/schema/qudt/>\n",
    "\n",
    "    SELECT (COUNT (DISTINCT ?cocatalyst) AS ?count) \n",
    "    WHERE {\n",
    "        ?cocatalyst a solar:Input ;\n",
    "            rdfs:label ?label ;\n",
    "            solar:hasRole solar:Co-catalyst ;\n",
    "            qudt:floatPercentage ?percent .\n",
    "    }\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"Number of co-catalyts with all properties: {row['count'].value}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "f1c9fbe5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of supports with all properties: 174\n"
     ]
    }
   ],
   "source": [
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <http://w3id.org/solar/o/core#>\n",
    "    PREFIX solarpc: <http://w3id.org/solar/o/pc#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX qudt: <http://qudt.org/2.1/schema/qudt/>\n",
    "\n",
    "    SELECT (COUNT (DISTINCT ?support) AS ?count) \n",
    "    WHERE {\n",
    "        ?support a solar:Input ;\n",
    "            rdfs:label ?label ;\n",
    "            solar:hasRole solarpc:Support ;\n",
    "            qudt:floatPercentage ?percent .\n",
    "    }\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"Number of supports with all properties: {row['count'].value}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "id": "9cd56099",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of dopants with all properties: 541\n"
     ]
    }
   ],
   "source": [
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <http://w3id.org/solar/o/core#>\n",
    "    PREFIX solarpc: <http://w3id.org/solar/o/pc#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX qudt: <http://qudt.org/2.1/schema/qudt/>\n",
    "\n",
    "    SELECT (COUNT (DISTINCT ?dopant) AS ?count) \n",
    "    WHERE {\n",
    "        ?dopant a solar:Input ;\n",
    "            rdfs:label ?label ;\n",
    "            solar:hasRole solar:Dopant ;\n",
    "            qudt:floatPercentage ?percent .\n",
    "    }\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"Number of dopants with all properties: {row['count'].value}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "id": "6a5440a4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of dyes with all properties: 33\n"
     ]
    }
   ],
   "source": [
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <http://w3id.org/solar/o/core#>\n",
    "    PREFIX solarpc: <http://w3id.org/solar/o/pc#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX qudt: <http://qudt.org/2.1/schema/qudt/>\n",
    "\n",
    "    SELECT (COUNT (DISTINCT ?dye) AS ?count) \n",
    "    WHERE {\n",
    "        ?dye a solar:Input ;\n",
    "            rdfs:label ?label ;\n",
    "            solar:hasRole solarpc:Dye ;\n",
    "            qudt:floatPercentage ?percent .\n",
    "    }\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"Number of dyes with all properties: {row['count'].value}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c88d859f",
   "metadata": {},
   "source": [
    "## Experiment outputs generation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "a998295a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generating mapping file\n",
      "Your mapping file is in mappings/outputs-solarchem-mapping.yml\n"
     ]
    }
   ],
   "source": [
    "!python -m mapeathor -i mappings/outputs-solarchem-mapping.xlsx -l yarrrml -o mappings/outputs-solarchem-mapping"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "d570f222",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "INFO | 2024-06-20 12:54:32,603 | 334 mapping rules retrieved.\n",
      "INFO | 2024-06-20 12:54:32,647 | Mapping partition with 324 groups generated.\n",
      "INFO | 2024-06-20 12:54:32,647 | Maximum number of rules within mapping group: 2.\n",
      "INFO | 2024-06-20 12:54:32,648 | Mappings processed in 1.827 seconds.\n",
      "INFO | 2024-06-20 12:54:36,739 | Number of triples generated in total: 1837300.\n",
      "INFO | 2024-06-20 12:54:36,739 | Materialization finished in 4.089 seconds.\n"
     ]
    }
   ],
   "source": [
    "!python -m morph_kgc config-outputs.ini"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "923f277e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1837300\n"
     ]
    }
   ],
   "source": [
    "g = rdflib.Graph()\n",
    "g.parse(\"result/outputs-solarchem.nt\")\n",
    "print(len(g))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "2c7a1ed9",
   "metadata": {},
   "outputs": [],
   "source": [
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <https://w3id.org/solar/o/core#>\n",
    "    PREFIX solarpc: <https://w3id.org/solar/o/pc#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX qudt: <http://qudt.org/2.1/schema/qudt/>\n",
    "    PREFIX prov: <http://www.w3.org/ns/prov#>\n",
    "\n",
    "    SELECT ?output ?label ?value ?unit ?expexec\n",
    "    WHERE {\n",
    "        ?output a solar:Output ;\n",
    "            rdfs:label ?label ;\n",
    "            qudt:numericValue ?value ;\n",
    "            qudt:unit ?unit ;\n",
    "            prov:wasGeneratedBy ?expexec .\n",
    "    }\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"{row.output} {row.label} {row.value} {row.unit} {row.expexec}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ae8d8f27",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of outputs with all properties: 18028\n"
     ]
    }
   ],
   "source": [
    "q_res = g.query(\"\"\"    \n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX solar: <https://w3id.org/solar/o/core#>\n",
    "    PREFIX solarpc: <https://w3id.org/solar/o/pc#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX qudt: <http://qudt.org/2.1/schema/qudt/>\n",
    "    PREFIX prov: <http://www.w3.org/ns/prov#>\n",
    "\n",
    "    SELECT (COUNT (DISTINCT ?output) AS ?count)\n",
    "    WHERE {\n",
    "        ?output a solar:Output ;\n",
    "            rdfs:label ?label ;\n",
    "            qudt:numericValue ?value ;\n",
    "            qudt:unit ?unit ;\n",
    "            prov:wasGeneratedBy ?expexec .\n",
    "    }\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "for row in q_res:\n",
    "    print(f\"Number of outputs with all properties: {row['count'].value}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e5e8c4e4",
   "metadata": {},
   "source": [
    "## Merging KGs into one"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "a2072de4",
   "metadata": {},
   "outputs": [],
   "source": [
    "!cat result/solarchem.nt result/outputs-solarchem.nt | uniq > result/solarchem-kg.nt"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aba028d9",
   "metadata": {},
   "source": [
    "## Finding chemical concepts in CHEBI and Wikidata"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f571ee98",
   "metadata": {},
   "source": [
    "### Create a list of unique values of chemicals mentioned in the data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "97e33831",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ID</th>\n",
       "      <th>No_de_Ref</th>\n",
       "      <th>Catalyst_name</th>\n",
       "      <th>TiO2_crystal_structure</th>\n",
       "      <th>Catalyst</th>\n",
       "      <th>Support</th>\n",
       "      <th>support_percent</th>\n",
       "      <th>Co_catalyst</th>\n",
       "      <th>co_catalyst_2</th>\n",
       "      <th>co_catalyst_3</th>\n",
       "      <th>...</th>\n",
       "      <th>C4H10_mol_m2h</th>\n",
       "      <th>C5H10_mol_m2h</th>\n",
       "      <th>C5H12_mol_m2h</th>\n",
       "      <th>CH3OH_mol_m2h</th>\n",
       "      <th>C2H5OH_mol_m2h</th>\n",
       "      <th>CH3COH_mol_m2h</th>\n",
       "      <th>HCOOH_mol_m2h</th>\n",
       "      <th>CH2O_mol_m2h</th>\n",
       "      <th>C2H4O2_mol_m2h</th>\n",
       "      <th>timestamp</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>TiO2</td>\n",
       "      <td>Anatase</td>\n",
       "      <td>TiO2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.01</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0000-00-00 00:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>TiO2</td>\n",
       "      <td>Anatase</td>\n",
       "      <td>TiO2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Ag</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.01</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0000-00-00 00:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "      <td>Ag/TiO2</td>\n",
       "      <td>Anatase</td>\n",
       "      <td>TiO2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Ag</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.01</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0000-00-00 00:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "      <td>Ag/TiO2</td>\n",
       "      <td>Anatase</td>\n",
       "      <td>TiO2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Ag</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.02</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0000-00-00 00:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>Ag/TiO2</td>\n",
       "      <td>Anatase</td>\n",
       "      <td>TiO2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Ag</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.03</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0000-00-00 00:00:00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows  95 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   ID  No_de_Ref Catalyst_name TiO2_crystal_structure Catalyst Support  \\\n",
       "0   1          1          TiO2                Anatase     TiO2     NaN   \n",
       "1   2          1          TiO2                Anatase     TiO2     NaN   \n",
       "2   3          1       Ag/TiO2                Anatase     TiO2     NaN   \n",
       "3   4          1       Ag/TiO2                Anatase     TiO2     NaN   \n",
       "4   5          1       Ag/TiO2                Anatase     TiO2     NaN   \n",
       "\n",
       "   support_percent Co_catalyst co_catalyst_2 co_catalyst_3  ... C4H10_mol_m2h  \\\n",
       "0              NaN         NaN           NaN           NaN  ...           NaN   \n",
       "1              NaN          Ag           NaN           NaN  ...           NaN   \n",
       "2              NaN          Ag           NaN           NaN  ...           NaN   \n",
       "3              NaN          Ag           NaN           NaN  ...           NaN   \n",
       "4              NaN          Ag           NaN           NaN  ...           NaN   \n",
       "\n",
       "   C5H10_mol_m2h  C5H12_mol_m2h CH3OH_mol_m2h  C2H5OH_mol_m2h CH3COH_mol_m2h  \\\n",
       "0            NaN            NaN          0.01             NaN            NaN   \n",
       "1            NaN            NaN          0.01             NaN            NaN   \n",
       "2            NaN            NaN          0.01             NaN            NaN   \n",
       "3            NaN            NaN          0.02             NaN            NaN   \n",
       "4            NaN            NaN          0.03             NaN            NaN   \n",
       "\n",
       "   HCOOH_mol_m2h CH2O_mol_m2h  C2H4O2_mol_m2h            timestamp  \n",
       "0            NaN          NaN             NaN  0000-00-00 00:00:00  \n",
       "1            NaN          NaN             NaN  0000-00-00 00:00:00  \n",
       "2            NaN          NaN             NaN  0000-00-00 00:00:00  \n",
       "3            NaN          NaN             NaN  0000-00-00 00:00:00  \n",
       "4            NaN          NaN             NaN  0000-00-00 00:00:00  \n",
       "\n",
       "[5 rows x 95 columns]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "exp_df = pd.read_csv(\"data/catalystsdata.csv\")\n",
    "exp_df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cb9fc30f",
   "metadata": {},
   "source": [
    "List of output formulas that appear as columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "ed7eff97",
   "metadata": {},
   "outputs": [],
   "source": [
    "outputs = pd.Series([\n",
    "    'H2',\n",
    "    'CO',\n",
    "    'CH4',\n",
    "    'C2H4',\n",
    "    'C2H6',\n",
    "    'C3H6',\n",
    "    'C3H8',\n",
    "    'C4H8',\n",
    "    'C4H10',\n",
    "    'C5H10',\n",
    "    'C5H12',\n",
    "    'CH3OH',\n",
    "    'C2H5OH',\n",
    "    'CH3COH',\n",
    "    'HCOOH',\n",
    "    'CH2O',\n",
    "    'C2H4O2'\n",
    "])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "c3d80494",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Chemicals</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TiO2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ZrO2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carbon</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>b-Ga2O3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Zn2GeO4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1052</th>\n",
       "      <td>C5H12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1053</th>\n",
       "      <td>C2H5OH</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1054</th>\n",
       "      <td>CH3COH</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1055</th>\n",
       "      <td>CH2O</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1056</th>\n",
       "      <td>C2H4O2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1057 rows  1 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     Chemicals\n",
       "0         TiO2\n",
       "1         ZrO2\n",
       "2       Carbon\n",
       "3      b-Ga2O3\n",
       "4      Zn2GeO4\n",
       "...        ...\n",
       "1052     C5H12\n",
       "1053    C2H5OH\n",
       "1054    CH3COH\n",
       "1055      CH2O\n",
       "1056    C2H4O2\n",
       "\n",
       "[1057 rows x 1 columns]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chems_df = pd.DataFrame()\n",
    "chems_df['Chemicals'] = pd.concat([exp_df['Catalyst'], exp_df['Support'], exp_df['Co_catalyst'], exp_df['co_catalyst_2'], exp_df['co_catalyst_3'], exp_df['Dopant'], exp_df['Dyes'], exp_df['Reductant'],outputs]).unique()\n",
    "chems_df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "214fdad5",
   "metadata": {},
   "source": [
    "### Find correspondences of mentions with CHEBI via EBI API\n",
    "https://www.ebi.ac.uk/ebisearch/documentation/rest-api"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "7e5e9c74",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Chemicals</th>\n",
       "      <th>chebi</th>\n",
       "      <th>wikidata</th>\n",
       "      <th>wikidata_multiple</th>\n",
       "      <th>chebi_multiple</th>\n",
       "      <th>uri</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TiO2</td>\n",
       "      <td>32234.0</td>\n",
       "      <td>Q193521</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/entity/Q193521</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ZrO2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/ZrO2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carbon</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>23012,50814,50813,36928,23014,30253,149691,294...</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/Carbon</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>b-Ga2O3</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>59216,36586,22702,50860</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/b-Ga2O3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Zn2GeO4</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/Zn2GeO4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1039</th>\n",
       "      <td>KHCO3 and H2SO4</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/KHCO3+and+H2SO4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1040</th>\n",
       "      <td>H2O:TEOA</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/H2O%3ATEOA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1041</th>\n",
       "      <td>Ethyl Acetate EA</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>26347,23849,33853</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/Ethyl+Acetate+EA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1042</th>\n",
       "      <td>TEOA:MeCN 1:4</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/TEOA%3AMeCN+1...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1043</th>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>85683,131417,137873,145242,134558,73841,131416...</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1044 rows  6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "             Chemicals    chebi wikidata wikidata_multiple  \\\n",
       "0                 TiO2  32234.0  Q193521               NaN   \n",
       "1                 ZrO2      NaN      NaN               NaN   \n",
       "2               Carbon      NaN      NaN               NaN   \n",
       "3              b-Ga2O3      NaN      NaN               NaN   \n",
       "4              Zn2GeO4      NaN      NaN               NaN   \n",
       "...                ...      ...      ...               ...   \n",
       "1039   KHCO3 and H2SO4      NaN      NaN               NaN   \n",
       "1040          H2O:TEOA      NaN      NaN               NaN   \n",
       "1041  Ethyl Acetate EA      NaN      NaN               NaN   \n",
       "1042     TEOA:MeCN 1:4      NaN      NaN               NaN   \n",
       "1043                 0      NaN      NaN               NaN   \n",
       "\n",
       "                                         chebi_multiple  \\\n",
       "0                                                   NaN   \n",
       "1                                                   NaN   \n",
       "2     23012,50814,50813,36928,23014,30253,149691,294...   \n",
       "3                               59216,36586,22702,50860   \n",
       "4                                                   NaN   \n",
       "...                                                 ...   \n",
       "1039                                                NaN   \n",
       "1040                                                NaN   \n",
       "1041                                  26347,23849,33853   \n",
       "1042                                                NaN   \n",
       "1043  85683,131417,137873,145242,134558,73841,131416...   \n",
       "\n",
       "                                                    uri  \n",
       "0                http://www.wikidata.org/entity/Q193521  \n",
       "1                 http://w3id.org/solar/i/Chemical/ZrO2  \n",
       "2               http://w3id.org/solar/i/Chemical/Carbon  \n",
       "3              http://w3id.org/solar/i/Chemical/b-Ga2O3  \n",
       "4              http://w3id.org/solar/i/Chemical/Zn2GeO4  \n",
       "...                                                 ...  \n",
       "1039   http://w3id.org/solar/i/Chemical/KHCO3+and+H2SO4  \n",
       "1040        http://w3id.org/solar/i/Chemical/H2O%3ATEOA  \n",
       "1041  http://w3id.org/solar/i/Chemical/Ethyl+Acetate+EA  \n",
       "1042  http://w3id.org/solar/i/Chemical/TEOA%3AMeCN+1...  \n",
       "1043                 http://w3id.org/solar/i/Chemical/0  \n",
       "\n",
       "[1044 rows x 6 columns]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chems_df = pd.read_csv(\"data/chemicals.csv\", dtype={'chebi': str})\n",
    "chems_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "3a64d81b",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "32234\n",
      "23012,50814,50813,36928,23014,30253,149691,29436,35605,36927,36929,36930,50809,35604,139538\n",
      "59216,36586,22702,50860\n",
      "31652,63616,63722,51867,32877,35358,25212\n",
      "50836\n",
      "30187,30191,30192\n",
      "31344\n",
      "31794\n",
      "81908\n",
      "29390\n",
      "36973,134404,132889,50594,33418,50797,50596,50595,36977,50803,33415,46730,132888,50860\n",
      "36973,132889,132888,33418,50860\n",
      "79089\n",
      "50832,50833\n",
      "30341\n",
      "133333\n",
      "27363,30185,37254,37255,29105,133337,88218,133340,49976,36578\n",
      "36973,132889,132888,33418,50860\n",
      "85287,90970,2341,142482,140626,140627,90980,136820,142483,142024,77193,77196,21345,21412,143102\n",
      "27573,30584,30582,30586,30585,48150,33478,59830,37171,53393,77023,84275,37172,48139,30581\n",
      "88916,88729,89101,89172,89179,89292,89293,89294,89500,89534,89535,89544,89547,89560,89692\n",
      "51110,51113,51115\n",
      "67195,62488,17138,42626\n",
      "50818,50819,50824,139548\n",
      "64132,64131,64123,45744,82851,9423,33517,48279,46848,46845,48367,25697,35274\n",
      "50836\n",
      "32234\n",
      "137381,137373,137379\n",
      "30399,28112,49786,137381,144805,85620,137373,47739,177874,133340,144804,25516,61258,137379,35677\n",
      "75955\n",
      "30704,50875\n",
      "36826,29307,17514,29306,33517,16830\n",
      "50860\n",
      "50860\n",
      "50796\n",
      "29287,30030,30050,50825\n",
      "33364,33400,75318,33398,52387,50831\n",
      "61484,53232,33839,60027\n",
      "35610\n",
      "27638,48828,85033,49415,74266,53306,26178,53284,131895,61465,85604,23016,23336,176591,61646\n",
      "131895\n",
      "142491,28262,37142,92211,37141,37143,26878,35681,48706,15734,25000,2468,18379,46850,50846\n",
      "29308,17514,50796\n",
      "51221,38574,38573,36158,60562,25248,26421\n",
      "88019,86224\n",
      "58945\n",
      "30551,30545,30546,30544\n",
      "48242\n",
      "133337\n",
      "30563\n",
      "29033\n",
      "45296,134805,32140,29425,29426,29441,29447,31319,52295,17303,7542,34967\n",
      "46726,50821\n",
      "47882,53263,19203,38077,47038,36317,36316,51590,47883,36309,26932,33833,38101\n",
      "174977,38163,38101\n",
      "33341,134436,52137,50950,50880,82802\n",
      "52200,51217\n",
      "29036,28694,30052,49552,51111,29037,23378,75044,75046\n",
      "50860\n",
      "41198\n",
      "47344\n",
      "51116,51114\n",
      "7438\n",
      "52991,50879,52990,22842,22843,22841,61368,78074,52231,52232,52233,52234,52235,52230,35036\n",
      "74876,29159,73642,144555,73512,142783,73440,73518,91269,73831,10047,8001,152557,72488,133028\n",
      "47564\n",
      "50834,50835\n",
      "53263,133489,133488,50406,33575,50860\n",
      "30664\n",
      "30664\n",
      "52754,52755,52756,52757,52759,52760,52762,50853\n",
      "36615,23849,76969\n",
      "32178,50860\n",
      "82533,50860\n",
      "25248,33575,26421,25212\n",
      "30045\n",
      "142491,28262,37142,92211,37141,37143,26878,35681,48706,15734,25000,2468,18379,46850,50846\n",
      "50809,50808,50799,50810,50594,50813,50798,50797,50595,50596,50807,50812,50806,50800,50801\n",
      "140499,140503,48730,75324,55323,60004\n",
      "61428,53682,53681,61427,60804,53310\n",
      "133353,133354,48730,60004\n",
      "36977,33418,36978,131896,132888,132889,36973,50814,46730,50803,33417,33415,50860\n",
      "33429,50860\n",
      "23012,50814,50813,36928,23014,30253,149691,29436,35605,36927,36929,36930,50809,35604,139538\n",
      "82586,60737,53284,172368,37997,60029,50860\n",
      "34565\n",
      "50808,50796\n",
      "57704,16261,22506,72813,73182,35274,75772\n",
      "50860\n",
      "82365\n",
      "133354,133353,48730,60004\n",
      "50808,50796\n",
      "136511\n",
      "27594,29434,29435,64656,29436,29950,15356,75307,33418,30039,30040,33417,36977,36978,33419\n",
      "53245,53248,82780,82783,82784\n",
      "16481,32285,57431,75178,91240,134711,41480,15832,57415,9889,88276,44383,140936,5850,16199\n",
      "151129\n",
      "91384\n",
      "9141,30512,49468,156535,82778,82780,82781,82783,82784,82785,82786,50826\n",
      "33359,63597\n",
      "30682,30685,30686,90223,149729,149755,149727,149745,149747,149749,149750,149752,149754,149758,149728\n",
      "33363,91075,91077\n",
      "28073,49544,33008,33009,33006,33010,33007,50076,53404,53245,53246,53247,51517,53248,60379\n",
      "22977,48775,37130,37249,77732,87720,90695,132657,79391,65041,53330,65400,65580,134689,3576\n",
      "32145,53448\n",
      "75142,133353\n",
      "87194,78408,133353\n",
      "85620,47739,177874,61258,144804,35677\n",
      "65748,28362,66193,65382,65385,65442,66192,68860\n",
      "35696\n",
      "53470\n",
      "26710\n",
      "29287,30030,30050,50825\n",
      "26833,29832,15138,29999,29316,29830,29831,29833,33411,87,17721,9578,46430,58411,50235\n",
      "50292\n",
      "33336,37317,49701\n",
      "33369,37264,48782\n",
      "33342,51000\n",
      "18248,29034,82664,29033,50823,131371,17423,86238,133333,50824,133337,139552,68438,143010,5044\n",
      "50860\n",
      "82780,82783,82784,82785,82786,75404,82781,82776,82778,138841,131968,78331,94668,145374,138885\n",
      "28685,49446,30511,135936,61145,71306,53393,71308,71310,73094,82685,60538,30409,83233,37239\n",
      "61474,61477,53198,53194,53196,61476,61479,61480,61475,53195,53197,53723,33839,60027\n",
      "66991\n",
      "49976\n",
      "30812\n",
      "50860\n",
      "33301,85545,90399,90403,61344,83174,83176,83177,83178,83179,90402,147303,75046,65716,25461\n",
      "57704,16261,22506,72813,73182,35274,75772\n",
      "36586,25696,23357,58941,76964,33282,18379,76969,134362,50860,76971,33281\n",
      "157903,30360,39095,39096,27642,32888,74949,466659,60384,59446,63012,75784,166872,52373,52374\n",
      "38071,30259,38930,1040,38074,38057,27726,38928,63953,34934,27399,34976,30264,15930,72475\n",
      "23357,76969\n",
      "53394\n",
      "18291,29035,25158,35154,29041,33011,245199,25155,29681,150430\n",
      "133333\n",
      "25016,49807,30180,27889,177890,77245,50860\n",
      "28659,33468,33467,33469,60949,30206,30207,33466,145885,138459,145607,51650,58529,60155,89236\n",
      "24859,30009,16382,156352,145921,156301,156354,138582,145923,146155,156320,156321,57403,67185,156322\n",
      "82546,9570\n",
      "23116,30120,17996,53306,30334,78067,63933,144979,36719,36721,36718,36720,36722,85782,52258\n",
      "73661\n",
      "73661\n",
      "133333\n",
      "30114\n",
      "9533\n",
      "28984,30150,30151,33629,49470,83862,83863,147353,799,149533,16466,86096,144060,144063,63848\n",
      "155903\n",
      "30236,30237,30238,17051,76159,77982,36890\n",
      "24061,30240,28044,30237,29997,17051,65910,74931,74934,30239,36895,50893,26979,35618,33281\n",
      "32130\n",
      "82200,82699,41688,84828,155001,61832,146726,152648,147638,150102,155166,149259,151157,154047,154444\n",
      "33324,37132,35104,59785,52470,52477,59798,59799,59795,51277,51278,59802,59792,59797,59800\n",
      "63631\n",
      "65310\n",
      "133326\n",
      "25107,18420,87194,133353,33974,39127,78408\n",
      "76480,75943,76482,75829,78434,76372,38383,36203,75942,60956,32385,48502,10275,32409,76113\n",
      "30168,30167,30166,27560,30165,75782,75769,51685,30169,30170,33610,39214,58596,39230,60145\n",
      "32594,37136,32595,37137,39125,39126\n",
      "144677,45993,59101,141775,31263,80110,48587,137114,48535,79091,83575,50860\n",
      "76054,76087,76086,76077,76080\n",
      "22984,29108,29320,39099,52255,52257,52258,176898,52254,131794,60186,39123,39124,176897,137425\n",
      "25555,29240,29352,36825,33792,22653,17196,30229,30226,30227,30228,30230,29351,33268,36934\n",
      "30145,49713,30144,48607\n",
      "30430,30433,37115,75632,75630,75633,75621,15637,31624,81908,51110,51114,68509,81539,18222\n",
      "25805,29356,29354,29355,29193,29194,33264,53201,53202,28006,76103,52938,51165,90368,133245\n",
      "86237,86303,86306,86310,73698,88778,86312,73697,77751,86233,86304,86307,86311,136715,35739\n",
      "143775,143774,74712,59055,143010,143023,4356,25696,61345,53415,134362,50860,36586,18379,76971\n",
      "24061,30240,28044,30237,29997,17051,65910,27595,72595,72593,149621,149624,28158,28442,73741\n",
      "33379,52465,42371,64110,63949,134679,42156,66037,66047,176517,132781,66043,131730,90954,85310\n",
      "78616,75416,76706,53199,17056,90310,51921,132560,16646,63630,23420,139113,76710,141059,60190\n",
      "144426,29034\n",
      "33815,25806,33693,33819,36932,149692,60905,50081,61073,37896,25805,33818,33264,36933,70982\n",
      "145070\n",
      "27698,33002,35170,33004,33003,33005,30015,35172,133598,53393,31430,77658,83665,84561,77894\n",
      "33374,49890\n",
      "36068,36070,33631,36071\n",
      "28833\n",
      "28976\n",
      "33322,49847,33496,38269,50980,50982\n",
      "26216,29104,25094,29967,29103,18019,32588,32030,66872,64406,88321,28384,55347,64338,8346\n",
      "26708,29102,29101,28741,33167,76209,35607,63510,146151,76208,86431,472805,31319,133353,146207\n",
      "28073,49544,33008,33009,33006,33010,33007,50076,53404,53245,53246,53247,51517,53248,60379\n",
      "18248,29034,82664,29033,50823,131371,17423,86238,133333,50824,133337,139552,68438,143010,5044\n",
      "82780,82783,82784,82785,82786,75404,82781,82776,82778,138841,131968,78331,94668,145374,138885\n",
      "85384,64144,64145,39025,65415\n",
      "53231\n",
      "80495,4325,139473,82316,35618\n",
      "35618\n",
      "33375,37286,37294,73893,68841,31644\n",
      "37143,140325\n",
      "48237,29239,146278,15378,29293,30479,29979,15971,29235,29303,29304,29305,33251,46711,48238\n",
      "138432,138434\n",
      "138432,138434\n",
      "59838,48379,47846\n",
      "29121,29424,29120,29272,35801,15429,52855,24835,24838,64770,64776,47838,74768,75878,133249\n",
      "22927,15858,22972,47265,48360,39141,39142,38981,37527,138103,22695,33117,36896,36900\n",
      "33344,84912,85337,85509,84913,134015,134016,146030\n",
      "32990,17909,30475,30476,27007,78184,156324,78225,78171,78172,78169,78196,77000,77001,78879\n",
      "33128,88015,139561,88021,139562\n",
      "36973,134404,132889,50594,33418,50797,50596,50595,36977,50803,33415,46730,132888,50860\n",
      "29275,29277,29278,17997,156463,21818,134095,134096,91091,30105,30106,30107,30108,29276,33266\n",
      "83318,78249,83413,83432,83415,29448,36825,35108,83571\n",
      "30979,30982,133487,30792,133485,133486,30985,30351\n",
      "139291,2976,61721,58416,28966,73095,73096,38199,58716,77670,38202,38203,29709,167885,18230\n",
      "155903\n",
      "60616,53222,60620,53229,30856,60678,60618,60622,60667,60621,60617,53228,53322,53308,53446\n",
      "52931,52358,52932,30351,30792,133485,133486,64999,69227,133487,69231,6339,52359,69235,30979\n",
      "52896\n",
      "52200,51217\n",
      "49798,39474,166831\n",
      "15377\n",
      "16183,29439,29440\n",
      "30751\n",
      "18276,84737,140447,84736,32000,29293,29295,29296,29297,145662,140450,140453\n",
      "26607,39417,85283,36388,133249,83955,36389,39418,71668,142092,133291,64623,58953,76928,84587\n",
      "72649,62602,72696,72650,62600,61041,72705,77931,77824,84568,62603,62510,61039,90525,61044\n",
      "82413,144331,75132,75126,75131,31191,76260,45086,64198,17824,46645,61022,3127,156577,3082\n",
      "27385\n",
      "25409,51683,26658,35618,33853,24828,27171,35681,36683,77746,25212\n",
      "81862\n",
      "17790,74838,48360,28148,76107,131631,60004,75771,76971,77746\n",
      "78870\n",
      "81862\n",
      "32139\n",
      "62955,67099,91159,39005,39010,39006,39011,39408,33554,33551,38785\n",
      "86477\n",
      "17883,67202,73228\n",
      "17790\n",
      "52634,63510,137066,137090,89308,62410,138872,46667,38633,46666,137070,31270,133947,86473,33696\n",
      "38137,17790,27615,28182,24814,62150,62527,156265,156213,59652,41883,88143,207496,155904,82559\n",
      "62367,82337,85302,17141,85262,85299,146186,71464,16000,71466,64032,43980\n",
      "76336,22469,76260,38868,132587,131607,141221,18917\n",
      "16236,1879,83166,67144,38736,64803,28410,46144,61238,17890,63861,17957,50687,73248,49000\n",
      "18099,75731,75725,59065,132899,89236,25187,75733,32327,9944,32250,32346,75734,9648,70479\n",
      "53449,46793,53709,53378,139326,78708,63052,32027,46550,15830,53259,61452,39558,91323,53515\n",
      "79034,156507,72564,84605,16330,50860\n",
      "35026,3752,39054,39065,132755,39011,23981,52153,28621,35225,35195,16000,23824,27136,50996\n",
      "2155,2160,2161,2305,2303,5380,77419,74408,2304,2302,85061,2301,84598,53378,17170\n",
      "149772,17790\n",
      "33599,27171,38101,36683,38106,37407,37143,35727,37141,75050,72588,48960,37948,78840,50994\n",
      "83629,28621,35026,132753,15882,63444,17394,31018,27732,28177,145276,156271,9518,28857,141542\n",
      "50995,50996\n",
      "76208\n",
      "33813,27314,33811,33806,29374,29375,86250,86247,18219,131394,131378,132765,9179,15377,132095\n",
      "16526,29325\n",
      "16526,29325\n",
      "17566,38472,88381,47841,183064,16667,27382,17346,65022,82541,64988,137676,79191,51853,27826\n",
      "24400,77746,33281\n",
      "18099,75731,75725,59065,132899,89236,25187,75733,32327,9944,32250,32346,75734,9648,70479\n",
      "30479,85044,85045,85042,85043\n",
      "50985\n",
      "26836\n",
      "27750,87392,4893,86055,78406,77700,78405,71637,135659,38750,63597,6441,59605,34626,47622\n",
      "131526\n",
      "278547\n",
      "27750\n",
      "174916,30879,33853\n",
      "27750,87392,4893,86055,78406,77700,78405,71637,135659,38750,63597,6441,59605,34626,47622\n",
      "17987,156310,136548,22743,146174,27995,137674,67410,49000,31268,5325,41237,52051,669,156103\n",
      "27750,87392,4893,86055,78406,77700,78405,71637,135659,38750,63597,6441,59605,34626,47622\n",
      "53378,53709,139326,30742,46793,53360,53436,78770,53541,139322,30741,53259,61452,53761,30740\n",
      "72343,72344\n",
      "55470,133945,55473,133947,55440,31630,91991,55475,32592,4470,55472,90959,42719,90960,55442\n",
      "17566,38472,88381,47841,183064,16667,27382,17346,65022,82541,64988,137676,79191,51853,27826\n",
      "9456,136988,136989,136990,138793,136991,85174,89607,53081,71465,73849,85253,85263,85262,85299\n",
      "26347,23849,33853\n",
      "85683,131417,137873,145242,134558,73841,131416,137147,91313,91297,91299,140862,167296,167297,85870\n",
      "17245,58072,29333,29334,74266,53306,26178,53284,131895,61465,85604,23016,176591,61646,61992\n",
      "29362,29853\n",
      "29858,30365,65236\n",
      "32879\n",
      "30963,30377,48362,43907,48365,48366,48361,48363\n",
      "30363\n",
      "23492,77914,77915,77916\n",
      "30358,30362\n",
      "16236\n",
      "79073\n",
      "77699,131198\n"
     ]
    }
   ],
   "source": [
    "headers = {'Accept': 'application/json'}\n",
    "query = 'https://www.ebi.ac.uk/ebisearch/ws/rest/chebi?query={}'\n",
    "jsonpath = parse('$.entries[*].id')\n",
    "\n",
    "chebi_id = {}\n",
    "chebi_multiple = {}\n",
    "for label in chems_df['Chemicals']:\n",
    "    \n",
    "    response = requests.get(query.format(label), headers=headers)\n",
    "    \n",
    "    if response.status_code == 200:\n",
    "        if len(response.json()['entries']) == 0:\n",
    "            chebi_id[label] = ''\n",
    "        elif len(response.json()['entries']) == 1:\n",
    "            chebi_id[label] = str(response.json()['entries'][0]['id'])\n",
    "            print(chebi_id[label])\n",
    "        else:\n",
    "            res_list = [match.value for match in jsonpath.find(response.json())]\n",
    "            chebi_multiple[label] = ','.join(res_list)\n",
    "            print(chebi_multiple[label])\n",
    "    else:\n",
    "            chebi_id[label] = ''\n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "5c624d96",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Chemicals</th>\n",
       "      <th>chebi</th>\n",
       "      <th>chebi_multiple</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TiO2</td>\n",
       "      <td>32234</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ZrO2</td>\n",
       "      <td></td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carbon</td>\n",
       "      <td>NaN</td>\n",
       "      <td>23012,50814,50813,36928,23014,30253,149691,294...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>b-Ga2O3</td>\n",
       "      <td>NaN</td>\n",
       "      <td>59216,36586,22702,50860</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Zn2GeO4</td>\n",
       "      <td></td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1052</th>\n",
       "      <td>C5H12</td>\n",
       "      <td>NaN</td>\n",
       "      <td>30358,30362</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1053</th>\n",
       "      <td>C2H5OH</td>\n",
       "      <td>16236</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1054</th>\n",
       "      <td>CH3COH</td>\n",
       "      <td></td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1055</th>\n",
       "      <td>CH2O</td>\n",
       "      <td>79073</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1056</th>\n",
       "      <td>C2H4O2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>77699,131198</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1057 rows  3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     Chemicals  chebi                                     chebi_multiple\n",
       "0         TiO2  32234                                                NaN\n",
       "1         ZrO2                                                       NaN\n",
       "2       Carbon    NaN  23012,50814,50813,36928,23014,30253,149691,294...\n",
       "3      b-Ga2O3    NaN                            59216,36586,22702,50860\n",
       "4      Zn2GeO4                                                       NaN\n",
       "...        ...    ...                                                ...\n",
       "1052     C5H12    NaN                                        30358,30362\n",
       "1053    C2H5OH  16236                                                NaN\n",
       "1054    CH3COH                                                       NaN\n",
       "1055      CH2O  79073                                                NaN\n",
       "1056    C2H4O2    NaN                                       77699,131198\n",
       "\n",
       "[1057 rows x 3 columns]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chems_df['chebi'] = chems_df['Chemicals'].map(chebi_id)\n",
    "chems_df['chebi_multiple'] = chems_df['Chemicals'].map(chebi_multiple)\n",
    "chems_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "4a6b3e3a",
   "metadata": {},
   "outputs": [],
   "source": [
    "chems_df.to_csv(\"data/chemicals.csv\", index=False, sep=\",\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7477f1a8",
   "metadata": {},
   "source": [
    "### Find corresponences with Wikidata via SPARQL endpoint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "ef7914c8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Chemicals</th>\n",
       "      <th>chebi</th>\n",
       "      <th>chebi_multiple</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TiO2</td>\n",
       "      <td>32234</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ZrO2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carbon</td>\n",
       "      <td>NaN</td>\n",
       "      <td>23012,50814,50813,36928,23014,30253,149691,294...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>b-Ga2O3</td>\n",
       "      <td>NaN</td>\n",
       "      <td>59216,36586,22702,50860</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Zn2GeO4</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1052</th>\n",
       "      <td>C5H12</td>\n",
       "      <td>NaN</td>\n",
       "      <td>30358,30362</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1053</th>\n",
       "      <td>C2H5OH</td>\n",
       "      <td>16236</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1054</th>\n",
       "      <td>CH3COH</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1055</th>\n",
       "      <td>CH2O</td>\n",
       "      <td>79073</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1056</th>\n",
       "      <td>C2H4O2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>77699,131198</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1057 rows  3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     Chemicals  chebi                                     chebi_multiple\n",
       "0         TiO2  32234                                                NaN\n",
       "1         ZrO2    NaN                                                NaN\n",
       "2       Carbon    NaN  23012,50814,50813,36928,23014,30253,149691,294...\n",
       "3      b-Ga2O3    NaN                            59216,36586,22702,50860\n",
       "4      Zn2GeO4    NaN                                                NaN\n",
       "...        ...    ...                                                ...\n",
       "1052     C5H12    NaN                                        30358,30362\n",
       "1053    C2H5OH  16236                                                NaN\n",
       "1054    CH3COH    NaN                                                NaN\n",
       "1055      CH2O  79073                                                NaN\n",
       "1056    C2H4O2    NaN                                       77699,131198\n",
       "\n",
       "[1057 rows x 3 columns]"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chems_df = pd.read_csv(\"data/chemicals.csv\", dtype={'chebi': str})\n",
    "chems_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "80466cb7",
   "metadata": {
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "sparql = SPARQLWrapper(\n",
    "    \"https://query.wikidata.org/sparql\"\n",
    ")\n",
    "sparql.setReturnFormat(JSON)\n",
    "\n",
    "query = \"\"\"\n",
    "    SELECT DISTINCT ?chem ?chebi_wd\n",
    "    WHERE\n",
    "    {{\n",
    "      ?chem wdt:P683 ?chebi_wd ;\n",
    "            skos:altLabel \"{}\"@en .\n",
    "    }} \n",
    "\"\"\"\n",
    "\n",
    "jsonpath = parse('$.results.bindings[*].chem.value')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "045faf13",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q193521\n",
      "Q190077\n",
      "Q214769\n",
      "Q412356\n",
      "Q216918\n",
      "Q758\n",
      "Q670\n",
      "Q205021\n",
      "Q744\n",
      "Q186357\n",
      "Q424257\n",
      "Q897\n",
      "Q880\n",
      "Q27104633,Q740\n",
      "Q116269,Q43010\n",
      "Q428946\n",
      "Q716\n",
      "Q753\n",
      "Q425127\n",
      "Q409173\n",
      "Q2380192\n",
      "Q407674\n",
      "Q186474,Q27089394,Q623\n",
      "Q56440222\n",
      "Q423673\n",
      "Q1090\n",
      "Q1087\n",
      "Q1086\n",
      "Q1089\n",
      "Q26841311,Q725\n",
      "Q1091\n",
      "Q102769\n",
      "Q407849\n",
      "Q414860\n",
      "Q411214\n",
      "Q2314\n",
      "Q183290,Q682\n",
      "Q414806\n",
      "Q421857\n",
      "Q1801\n",
      "Q1385\n",
      "Q1038\n",
      "Q677\n",
      "Q27144155\n",
      "Q1053\n",
      "Q204714\n",
      "Q407867\n",
      "Q27158631,Q942\n",
      "Q731\n",
      "Q708\n",
      "Q484583,Q20035886,Q674\n",
      "Q484940,Q1103\n",
      "Q72499282\n",
      "Q688\n",
      "Q314036\n",
      "Q27104698,Q663\n",
      "Q1963030\n",
      "Q207442\n",
      "Q938\n",
      "Q660\n",
      "Q618\n",
      "Q1112\n",
      "Q4847704\n",
      "Q706\n",
      "Q185906,Q29519883,Q627\n",
      "Q568\n",
      "Q1094\n",
      "Q629\n",
      "Q27143862\n",
      "Q170545,Q27103475\n",
      "Q1849\n",
      "Q428946\n",
      "Q483752,Q722\n",
      "Q1819\n",
      "Q27104698\n",
      "Q895\n",
      "Q243547,Q20816880,Q703\n",
      "Q658\n",
      "Q737\n",
      "Q27144218,Q1832\n",
      "Q485277,Q60168\n",
      "Q315860\n",
      "Q207843\n",
      "Q879\n",
      "Q1046\n",
      "Q1096\n",
      "Q2370426\n",
      "Q209143\n",
      "Q283\n",
      "Q37129\n",
      "Q161233\n",
      "Q3027893\n",
      "Q16392\n",
      "Q410529\n",
      "Q339975\n",
      "Q179731\n",
      "Q407806\n",
      "Q211086\n",
      "Q14982\n",
      "Q410387,Q617563\n",
      "Q16392\n",
      "Q423282\n",
      "Q192642\n",
      "Q408022,Q27098592\n",
      "Q14982\n",
      "Q410728\n",
      "Q407895\n",
      "Q4118\n",
      "Q424314\n",
      "Q379885\n",
      "Q407577\n",
      "Q27144175\n",
      "Q2025\n",
      "Q153\n"
     ]
    }
   ],
   "source": [
    "wd_id = {}\n",
    "wd_multiple = {}\n",
    "for label in chems_df['Chemicals']:\n",
    "    \n",
    "    time.sleep(0.5)\n",
    "    wd_id[label] = ''\n",
    "    sparql.setQuery(query.format(label))\n",
    "    \n",
    "    try:\n",
    "        res = sparql.queryAndConvert()\n",
    "        \n",
    "        if len(res['results']['bindings']) == 0:\n",
    "            wd_id[label] = ''\n",
    "        elif len(res['results']['bindings']) == 1:\n",
    "            wd_id[label] = res['results']['bindings'][0]['chem']['value'].replace('http://www.wikidata.org/entity/', '')\n",
    "            print(wd_id[label])\n",
    "        else:\n",
    "            js_res = jsonpath.find(res)\n",
    "            res_list = [match.value for match in jsonpath.find(res)]\n",
    "            wd_multiple[label] = ','.join(res_list).replace('http://www.wikidata.org/entity/', '')\n",
    "            print(wd_multiple[label])\n",
    "            \n",
    "    except:\n",
    "        wd_id[label] = ''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "f91f9eb9",
   "metadata": {},
   "outputs": [],
   "source": [
    "outputs_wd = {\n",
    "    'H2': 'Q3027893',\n",
    "    'CO': 'Q2025',\n",
    "    'CH4': 'Q37129',\n",
    "    'C2H4': 'Q151313',\n",
    "    'C2H6': 'Q52858',\n",
    "    'C3H6': 'Q151324',\n",
    "    'C3H8': 'Q131189',\n",
    "    'C4H8': 'Q151335',\n",
    "    'C4H10': 'Q134192',\n",
    "    'C5H10': 'Q151353',\n",
    "    'C5H12': 'Q2799651',\n",
    "    'CH3OH': 'Q14982',\n",
    "    'C2H5OH': 'Q153',\n",
    "    'CH3COH': 'Q61457',\n",
    "    'HCOOH': 'Q161233',\n",
    "    'CH2O': 'Q161210',\n",
    "    'C2H4O2': 'Q47512',\n",
    "}\n",
    "wd_id.update(outputs_wd)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "51cf5cdd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Chemicals</th>\n",
       "      <th>chebi</th>\n",
       "      <th>chebi_multiple</th>\n",
       "      <th>wikidata</th>\n",
       "      <th>wikidata_multiple</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TiO2</td>\n",
       "      <td>32234</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Q193521</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ZrO2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td></td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carbon</td>\n",
       "      <td>NaN</td>\n",
       "      <td>23012,50814,50813,36928,23014,30253,149691,294...</td>\n",
       "      <td></td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>b-Ga2O3</td>\n",
       "      <td>NaN</td>\n",
       "      <td>59216,36586,22702,50860</td>\n",
       "      <td></td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Zn2GeO4</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td></td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1052</th>\n",
       "      <td>C5H12</td>\n",
       "      <td>NaN</td>\n",
       "      <td>30358,30362</td>\n",
       "      <td>Q2799651</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1053</th>\n",
       "      <td>C2H5OH</td>\n",
       "      <td>16236</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Q153</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1054</th>\n",
       "      <td>CH3COH</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Q61457</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1055</th>\n",
       "      <td>CH2O</td>\n",
       "      <td>79073</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Q161210</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1056</th>\n",
       "      <td>C2H4O2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>77699,131198</td>\n",
       "      <td>Q47512</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1057 rows  5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     Chemicals  chebi                                     chebi_multiple  \\\n",
       "0         TiO2  32234                                                NaN   \n",
       "1         ZrO2    NaN                                                NaN   \n",
       "2       Carbon    NaN  23012,50814,50813,36928,23014,30253,149691,294...   \n",
       "3      b-Ga2O3    NaN                            59216,36586,22702,50860   \n",
       "4      Zn2GeO4    NaN                                                NaN   \n",
       "...        ...    ...                                                ...   \n",
       "1052     C5H12    NaN                                        30358,30362   \n",
       "1053    C2H5OH  16236                                                NaN   \n",
       "1054    CH3COH    NaN                                                NaN   \n",
       "1055      CH2O  79073                                                NaN   \n",
       "1056    C2H4O2    NaN                                       77699,131198   \n",
       "\n",
       "      wikidata wikidata_multiple  \n",
       "0      Q193521               NaN  \n",
       "1                            NaN  \n",
       "2                            NaN  \n",
       "3                            NaN  \n",
       "4                            NaN  \n",
       "...        ...               ...  \n",
       "1052  Q2799651               NaN  \n",
       "1053      Q153               NaN  \n",
       "1054    Q61457               NaN  \n",
       "1055   Q161210               NaN  \n",
       "1056    Q47512               NaN  \n",
       "\n",
       "[1057 rows x 5 columns]"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chems_df['wikidata'] = chems_df['Chemicals'].map(wd_id)\n",
    "chems_df['wikidata_multiple'] = chems_df['Chemicals'].map(wd_multiple)\n",
    "chems_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "954d3ca4",
   "metadata": {},
   "outputs": [],
   "source": [
    "chems_df.to_csv(\"data/chemicals.csv\", index=False, sep=\",\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4d268551",
   "metadata": {},
   "source": [
    "### Creating subject URI"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "64854b83",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Chemicals</th>\n",
       "      <th>chebi</th>\n",
       "      <th>chebi_multiple</th>\n",
       "      <th>wikidata</th>\n",
       "      <th>wikidata_multiple</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TiO2</td>\n",
       "      <td>32234</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Q193521</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ZrO2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carbon</td>\n",
       "      <td>NaN</td>\n",
       "      <td>23012,50814,50813,36928,23014,30253,149691,294...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>b-Ga2O3</td>\n",
       "      <td>NaN</td>\n",
       "      <td>59216,36586,22702,50860</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Zn2GeO4</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1052</th>\n",
       "      <td>C5H12</td>\n",
       "      <td>NaN</td>\n",
       "      <td>30358,30362</td>\n",
       "      <td>Q2799651</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1053</th>\n",
       "      <td>C2H5OH</td>\n",
       "      <td>16236</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Q153</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1054</th>\n",
       "      <td>CH3COH</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Q61457</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1055</th>\n",
       "      <td>CH2O</td>\n",
       "      <td>79073</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Q161210</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1056</th>\n",
       "      <td>C2H4O2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>77699,131198</td>\n",
       "      <td>Q47512</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1057 rows  5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     Chemicals  chebi                                     chebi_multiple  \\\n",
       "0         TiO2  32234                                                NaN   \n",
       "1         ZrO2    NaN                                                NaN   \n",
       "2       Carbon    NaN  23012,50814,50813,36928,23014,30253,149691,294...   \n",
       "3      b-Ga2O3    NaN                            59216,36586,22702,50860   \n",
       "4      Zn2GeO4    NaN                                                NaN   \n",
       "...        ...    ...                                                ...   \n",
       "1052     C5H12    NaN                                        30358,30362   \n",
       "1053    C2H5OH  16236                                                NaN   \n",
       "1054    CH3COH    NaN                                                NaN   \n",
       "1055      CH2O  79073                                                NaN   \n",
       "1056    C2H4O2    NaN                                       77699,131198   \n",
       "\n",
       "      wikidata wikidata_multiple  \n",
       "0      Q193521               NaN  \n",
       "1          NaN               NaN  \n",
       "2          NaN               NaN  \n",
       "3          NaN               NaN  \n",
       "4          NaN               NaN  \n",
       "...        ...               ...  \n",
       "1052  Q2799651               NaN  \n",
       "1053      Q153               NaN  \n",
       "1054    Q61457               NaN  \n",
       "1055   Q161210               NaN  \n",
       "1056    Q47512               NaN  \n",
       "\n",
       "[1057 rows x 5 columns]"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chems_df = pd.read_csv(\"data/chemicals.csv\", dtype={'chebi': str})\n",
    "chems_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "53e3367b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Chemicals</th>\n",
       "      <th>chebi</th>\n",
       "      <th>chebi_multiple</th>\n",
       "      <th>wikidata</th>\n",
       "      <th>wikidata_multiple</th>\n",
       "      <th>uri</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TiO2</td>\n",
       "      <td>32234</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Q193521</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/entity/Q193521</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ZrO2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/ZrO2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carbon</td>\n",
       "      <td>NaN</td>\n",
       "      <td>23012,50814,50813,36928,23014,30253,149691,294...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/Carbon</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>b-Ga2O3</td>\n",
       "      <td>NaN</td>\n",
       "      <td>59216,36586,22702,50860</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/b-Ga2O3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Zn2GeO4</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://w3id.org/solar/i/Chemical/Zn2GeO4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1052</th>\n",
       "      <td>C5H12</td>\n",
       "      <td>NaN</td>\n",
       "      <td>30358,30362</td>\n",
       "      <td>Q2799651</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/entity/Q2799651</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1053</th>\n",
       "      <td>C2H5OH</td>\n",
       "      <td>16236</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Q153</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/entity/Q153</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1054</th>\n",
       "      <td>CH3COH</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Q61457</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/entity/Q61457</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1055</th>\n",
       "      <td>CH2O</td>\n",
       "      <td>79073</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Q161210</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/entity/Q161210</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1056</th>\n",
       "      <td>C2H4O2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>77699,131198</td>\n",
       "      <td>Q47512</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/entity/Q47512</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1057 rows  6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     Chemicals  chebi                                     chebi_multiple  \\\n",
       "0         TiO2  32234                                                NaN   \n",
       "1         ZrO2    NaN                                                NaN   \n",
       "2       Carbon    NaN  23012,50814,50813,36928,23014,30253,149691,294...   \n",
       "3      b-Ga2O3    NaN                            59216,36586,22702,50860   \n",
       "4      Zn2GeO4    NaN                                                NaN   \n",
       "...        ...    ...                                                ...   \n",
       "1052     C5H12    NaN                                        30358,30362   \n",
       "1053    C2H5OH  16236                                                NaN   \n",
       "1054    CH3COH    NaN                                                NaN   \n",
       "1055      CH2O  79073                                                NaN   \n",
       "1056    C2H4O2    NaN                                       77699,131198   \n",
       "\n",
       "      wikidata wikidata_multiple                                       uri  \n",
       "0      Q193521               NaN    http://www.wikidata.org/entity/Q193521  \n",
       "1          NaN               NaN     http://w3id.org/solar/i/Chemical/ZrO2  \n",
       "2          NaN               NaN   http://w3id.org/solar/i/Chemical/Carbon  \n",
       "3          NaN               NaN  http://w3id.org/solar/i/Chemical/b-Ga2O3  \n",
       "4          NaN               NaN  http://w3id.org/solar/i/Chemical/Zn2GeO4  \n",
       "...        ...               ...                                       ...  \n",
       "1052  Q2799651               NaN   http://www.wikidata.org/entity/Q2799651  \n",
       "1053      Q153               NaN       http://www.wikidata.org/entity/Q153  \n",
       "1054    Q61457               NaN     http://www.wikidata.org/entity/Q61457  \n",
       "1055   Q161210               NaN    http://www.wikidata.org/entity/Q161210  \n",
       "1056    Q47512               NaN     http://www.wikidata.org/entity/Q47512  \n",
       "\n",
       "[1057 rows x 6 columns]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "uri = {}\n",
    "for index, row in chems_df.iterrows():\n",
    "    if not pd.isna(row['wikidata']):\n",
    "        uri[row['Chemicals']] = 'http://www.wikidata.org/entity/' + row['wikidata']\n",
    "    elif not pd.isna(row['chebi']):\n",
    "        uri[row['Chemicals']] = 'http://purl.obolibrary.org/obo/CHEBI_' + str(row['chebi'])\n",
    "    else:\n",
    "        uri[row['Chemicals']] = 'http://w3id.org/solar/i/Chemical/' + urllib.parse.quote_plus(str(row['Chemicals']))\n",
    "\n",
    "chems_df['uri'] = chems_df['Chemicals'].map(uri)\n",
    "chems_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "2e9cfb53",
   "metadata": {},
   "outputs": [],
   "source": [
    "chems_df.to_csv(\"data/chemicals.csv\", index=False, sep=\",\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.undefined"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
